// گو از ثابت‌های کاراکتر، رشته، بولین،
// و متغیر‌های عددی پشتیبانی می‌کند.

package main

import "fmt"
import "math"

// با عبارت `const` میتوانید یک مقدار ثابت تعریف کنید.
const s string = "constant"

func main() {
    fmt.Println(s)

    // عبارت `const` میتواند هر جایی که
    // `var` قرار گیرد استفاده شود.
    const n = 500000000

    // مقادیر ثابت‌ها میتوانند شامل عبارات منطقی و ریاضی نیز باشند.
    const d = 3e20 / n
    fmt.Println(d)

    // یک ثابت عددی تا زمانی که بصورت تبدیلی
    // واضح به آن تایپی داده نشده، تایپی ندارد.
    fmt.Println(int64(d))

    // به یک عدد میتوان بوسیله‌ی استفاده از آن در یک کانتکست تایپ داد،
    // به مانند مقداری دهی یک متغیر یا صدا کردن یک تابع.
    // برای مثال،  از خروجی `math.Sin`
    // انتظار یک `float64` را داریم.
    fmt.Println(math.Sin(n))
}
