# برای اجرای برنامه، کد را در
# فایلی به نام `hello-world.go`
# قرار دهید و
# با استفاده از دستور `go run`
# در ترمینال برنامه را اجرا کنید.
$ go run hello-world.go
hello world

# گاهی اوقات میخواهیم برنامه‌ی
# مابصورت یک فایل باینری اجرا شود،
# با استفاده از `go build`
# میتونید آشنا شوید.
$ go build hello-world.go
$ ls
hello-world	hello-world.go

# و به راحتی و مستقیم میتونیم باینری
# ساخته شده رو مستقیم اجرا کنیم.
$ ./hello-world
hello world

# حالا ما میتونیم یک برنامه‌ی پایه‌ای گو
# را بسازیم و اجرا کنیم،
# بیاید بیشتر در مورد این زبان بدانیم
