// گو انواع مختلفی از مقادیر شامل رشته،
// عدد صحیح، عدد اعشاری، بولین و… می‌باشد.
// تعدادی از مثال‌های ابتدایی رو ببینم.

package main

import "fmt"

func main() {

    // رشته‌ها، که با کاراکتر + به هم‌دیگر متصل می‌شوند.
    fmt.Println("go" + "lang")

    // اعداد صحیح و اعشاری
    fmt.Println("1+1 =", 1+1)
    fmt.Println("7.0/3.0 =", 7.0/3.0)

    // بولین‌ها، با عملگر‌های بولینی که از آنها انتظار داریم.
    fmt.Println(true && false)
    fmt.Println(true || false)
    fmt.Println(!true)
}
